#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.aws-acm.aws_route53_record.cert_validation_shunblog_org will be destroyed
  - resource "aws_route53_record" "cert_validation_shunblog_org" {
      - fqdn    = "_a48e71a8f9a4619202c3e1ff2e59bcb1.shunblog.org" -> null
      - id      = "Z29GQ4UV60ZIAS__a48e71a8f9a4619202c3e1ff2e59bcb1_CNAME" -> null
      - name    = "_a48e71a8f9a4619202c3e1ff2e59bcb1" -> null
      - records = [
          - "_ba7597dcc259a41649e00686335bb883.hkvuiqjoua.acm-validations.aws.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z29GQ4UV60ZIAS" -> null
    }

  # module.aws-acm.aws_route53_record.cert_validation_shunkakinoki_com will be destroyed
  - resource "aws_route53_record" "cert_validation_shunkakinoki_com" {
      - fqdn    = "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com" -> null
      - id      = "Z19V0BNFYY29A__7d70e7567830ded68ef35de5b0f509bd_CNAME" -> null
      - name    = "_7d70e7567830ded68ef35de5b0f509bd" -> null
      - records = [
          - "_33628ef038fed6432842b8398d51f169.tljzshvwok.acm-validations.aws.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z19V0BNFYY29A" -> null
    }

  # module.aws-cloudfront.aws_acm_certificate.shunblog_org will be created
  + resource "aws_acm_certificate" "shunblog_org" {
      + arn                       = (known after apply)
      + domain_name               = "shunblog.org"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "*.shunblog.org",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.aws-cloudfront.aws_acm_certificate.shunkakinoki_com will be created
  + resource "aws_acm_certificate" "shunkakinoki_com" {
      + arn                       = (known after apply)
      + domain_name               = "shunkakinoki.com"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "*.shunkakinoki.com",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.aws-cloudfront.aws_acm_certificate_validation.cert_shunblog_org will be created
  + resource "aws_acm_certificate_validation" "cert_shunblog_org" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-cloudfront.aws_acm_certificate_validation.cert_shunkakinoki_com will be created
  + resource "aws_acm_certificate_validation" "cert_shunkakinoki_com" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-cloudfront.aws_cloudfront_distribution.shunblog_org will be updated in-place
  ~ resource "aws_cloudfront_distribution" "shunblog_org" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
        aliases                        = [
            "shunblog.org",
        ]
        arn                            = "arn:aws:cloudfront::589845989135:distribution/E2BBCLCE1B13O7"
        caller_reference               = "terraform-20191217180833777200000001"
        domain_name                    = "d1fd941k2g4jmb.cloudfront.net"
        enabled                        = true
        etag                           = "E2KJK3Z6NXQKU6"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E2BBCLCE1B13O7"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = false
        last_modified_time             = "2019-12-17 18:08:33.903 +0000 UTC"
        price_class                    = "PriceClass_All"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {}
        wait_for_deployment            = true

        default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = false
            default_ttl            = 86400
            max_ttl                = 31536000
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "S3-shunblog.org"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = true
                query_string_cache_keys = []

                cookies {
                    forward           = "all"
                    whitelisted_names = []
                }
            }
        }

        origin {
            domain_name = "shunblog.org.s3.amazonaws.com"
            origin_id   = "S3-shunblog.org"

            custom_origin_config {
                http_port                = 80
                https_port               = 443
                origin_keepalive_timeout = 5
                origin_protocol_policy   = "http-only"
                origin_read_timeout      = 30
                origin_ssl_protocols     = [
                    "TLSv1",
                    "TLSv1.1",
                    "TLSv1.2",
                ]
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:589845989135:certificate/2a2aa060-7a0b-4c53-af3f-195505b09220" -> (known after apply)
            cloudfront_default_certificate = false
            minimum_protocol_version       = "TLSv1"
            ssl_support_method             = "sni-only"
        }
    }

  # module.aws-cloudfront.aws_cloudfront_distribution.shunkakinoki_com will be updated in-place
  ~ resource "aws_cloudfront_distribution" "shunkakinoki_com" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
        aliases                        = [
            "shunkakinoki.com",
        ]
        arn                            = "arn:aws:cloudfront::589845989135:distribution/E1WX90PES8IZ5N"
        caller_reference               = "terraform-20191218053452685500000001"
        domain_name                    = "d2u1ftrxn4zlf1.cloudfront.net"
        enabled                        = true
        etag                           = "E3FL83FK9J95AU"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E1WX90PES8IZ5N"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = false
        last_modified_time             = "2019-12-18 05:34:52.843 +0000 UTC"
        price_class                    = "PriceClass_All"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {}
        wait_for_deployment            = true

        default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = false
            default_ttl            = 86400
            max_ttl                = 31536000
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "S3-shunkakinoki.com"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = true
                query_string_cache_keys = []

                cookies {
                    forward           = "all"
                    whitelisted_names = []
                }
            }
        }

        origin {
            domain_name = "shunkakinoki.com.s3.amazonaws.com"
            origin_id   = "S3-shunkakinoki.com"

            custom_origin_config {
                http_port                = 80
                https_port               = 443
                origin_keepalive_timeout = 5
                origin_protocol_policy   = "http-only"
                origin_read_timeout      = 30
                origin_ssl_protocols     = [
                    "TLSv1",
                    "TLSv1.1",
                    "TLSv1.2",
                ]
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:589845989135:certificate/984332ec-fae5-4e46-9d11-db08fcf1efae" -> (known after apply)
            cloudfront_default_certificate = false
            minimum_protocol_version       = "TLSv1"
            ssl_support_method             = "sni-only"
        }
    }

  # module.aws-cloudfront.aws_route53_record.cert_validation_shunblog_org will be created
  + resource "aws_route53_record" "cert_validation_shunblog_org" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z29GQ4UV60ZIAS"
    }

  # module.aws-cloudfront.aws_route53_record.cert_validation_shunkakinoki_com will be created
  + resource "aws_route53_record" "cert_validation_shunkakinoki_com" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-route-53.aws_route53_record.shunkakinoki-com-A will be created
  + resource "aws_route53_record" "shunkakinoki-com-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shunkakinoki.com"
      + type            = "A"
      + zone_id         = "Z19V0BNFYY29A"

      + alias {
          + evaluate_target_health = false
          + name                   = "d2u1ftrxn4zlf1.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.aws-cloudfront.module.aws-acm.aws_acm_certificate.shunblog_org will be destroyed
  - resource "aws_acm_certificate" "shunblog_org" {
      - arn                       = "arn:aws:acm:us-east-1:589845989135:certificate/2a2aa060-7a0b-4c53-af3f-195505b09220" -> null
      - domain_name               = "shunblog.org" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "shunblog.org"
              - resource_record_name  = "_a48e71a8f9a4619202c3e1ff2e59bcb1.shunblog.org."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_ba7597dcc259a41649e00686335bb883.hkvuiqjoua.acm-validations.aws."
            },
          - {
              - domain_name           = "*.shunblog.org"
              - resource_record_name  = "_a48e71a8f9a4619202c3e1ff2e59bcb1.shunblog.org."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_ba7597dcc259a41649e00686335bb883.hkvuiqjoua.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:589845989135:certificate/2a2aa060-7a0b-4c53-af3f-195505b09220" -> null
      - subject_alternative_names = [
          - "*.shunblog.org",
        ] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.aws-cloudfront.module.aws-acm.aws_acm_certificate.shunkakinoki_com will be destroyed
  - resource "aws_acm_certificate" "shunkakinoki_com" {
      - arn                       = "arn:aws:acm:us-east-1:589845989135:certificate/984332ec-fae5-4e46-9d11-db08fcf1efae" -> null
      - domain_name               = "shunkakinoki.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "shunkakinoki.com"
              - resource_record_name  = "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_33628ef038fed6432842b8398d51f169.tljzshvwok.acm-validations.aws."
            },
          - {
              - domain_name           = "*.shunkakinoki.com"
              - resource_record_name  = "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_33628ef038fed6432842b8398d51f169.tljzshvwok.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:589845989135:certificate/984332ec-fae5-4e46-9d11-db08fcf1efae" -> null
      - subject_alternative_names = [
          - "*.shunkakinoki.com",
        ] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

Plan: 7 to add, 2 to change, 4 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
